Repository: nitindhavan/servicesprojectmainupdated
Catalog: lib/l10n/app_*.arb
Languages: ar

source: Profile
ar: الملف الشخصي

source: Addresses
ar: العناوين

source: Notifications
ar: ألاشعارات

source: Shop Type
ar: نوع المحل

source: Language
ar: اللغة

source: Wallet
ar: المحفظة

source: Support US
ar: أدعمنا

source: Invite
ar: مشاركة التطبيق

source: Contact Us
ar: أتصل بنا

source: Get Paid
ar: احصل على نقودك

source: Logout
ar: تسجيل الخروج

source: Hello
ar: مرحبا

source: Your Email
ar: بريدك الإلكتروني

source: Enter Your Email
ar: أدخل بريدك الإلكتروني

source: Where are You From
ar: بلد الاقامة

source: Country
ar: الدولة

source: City
ar: المدينة

source: Your Name
ar: أسم المستخدم

source: Enter Your Name
ar: أدخل أسم المستخدم

source: Your Shop Name
ar: أدخل أسم المحل

source: Enter Your Shop Name
ar: أدخل أسم المحل الخاص بك

source: Your Shop Type is
ar: نوع المحل

source: Gas Sevices
ar: خدمات الغاز

source: Water Services
ar: خدمات الماء

source: You are a
ar: أنت

source: Customer
ar: العميل

source: Service Provider
ar: محل

source: All Products
ar: كل المنتجات

source: Orders
ar: الطلبيات

source: My Orders
ar: طلبياتي

source: My Products
ar: منتجاتي

source: Add New Address
ar: أضافة عنوان جديد

source: Area,Street
ar: الحي ,الشارع

source: building name
ar: أسم العمارة

source: Floor No
ar: رقم الطابق

source: Apartment No
ar: رقم الشقة

source: Deliver Here
ar: التوصيل هنا

source: Add New Product
ar: اضافة منتج جديد

source: Confirm
ar: أعتمد

source: Are you sure to delete this item from our database
ar: هل أنت متأكد من حذف هذا العنصر

source: No
ar: لا

source: Yes
ar: نعم

source: Remove
ar: حذف

source: Enter name of the product
ar: أدخل اسم المنتج

source: Enter quantity per piece in liter
ar: أدخل حجم المنتج باللتر

source: Enter price per piece in
ar: أدخل السعر

source: Enter Delivery charge in
ar: أدخل سعر التوصيل

source: Enter available stock
ar: أدخل الكمية المتوفرة لديكم

source: Select Product Type
ar: اختر نوع المنتج

source: Publish
ar: نشر

source: Only published products will be available to clients
ar: فقط المنتجات المنشورة ستكون متاحة للعملاء

source: Please select product type
ar: الرجاء تحديد نوع المنتج

source: Save
ar: حفظ

source: Select Photo
ar: اختر الصور

source: Shipping Address
ar: عنوان الشحن

# newString
source: New
ar: جديد

source: Are you sure to delete
ar: تأكيد عملية الحذف

source: Other Services
ar: خدمات أخرى

source: Please don't close app
ar: الرجاء عدم اغلاق التطبيق

source: Cart
ar: أضافة للسلة

source: SubTotal
ar: المبلغ إلاجمالي

source: Delivery Charge
ar: سعر التوصيل

source: Total
ar: المبلغ الكلي

source: Please Select Address to continue
ar: الرجاء أدخال العنوان

source: New Address
ar: عنوان جديد

source: Please Select Payment method to continue
ar: الرجاء تحديد طريقة الدفع

source: Cash On Delivery
ar: الدفع عند الاستلام

source: Confirm Order
ar: تأكيد الطلب

source: Success:
ar: تم:

source: Error
ar: خطاء

source: Cancelled
ar: ملغي

source: Payment is successful
ar: تم الدفع بنجاح

source: Completed
ar: تم

source: Sort By
ar: ترتيب حسب

source: Sort By A-Z
ar: ترتيب حسب الاسم

source: Sort By Shop
ar: ترتيب حسب اسم المحل

source: Sort By Time
ar: ترتيب بحسب التاريخ

source: No Orders Yet
ar: لا توجد طلبات حتى الآن

source: Adding you to our team ...
ar: انضم إلى فريقنا ...

# continueString
source: Continue
ar: استمر

source: credentials
ar: اسم المستخدم وكلمة المرور

source: PayPal Credentials
ar: اسم المستخدم وكلمة المرور الخاص بالبايبال

source: We wil pay you by using your paypal email address, so please enter correct email address used to login on paypal
ar: سندفع لك باستخدام عنوان بريدك الإلكتروني في البايبال لذا يرجى إدخال عنوان البريد الإلكتروني الصحيح المستخدم لتسجيل الدخول على البايبال

source: Please Enter your name on PayPal
ar: الرجاء إدخال اسمك على البايبال

source: Please enter PayPal email address
ar: الرجاء إدخال عنوان البريد الإلكتروني الخاص بالبايبال

source: Update
ar: تعديل

source: MY REWARD
ar: مكافأتى

source: This is awesome app for Gas and water services
ar: هذا تطبيق رائع لخدمات الغاز والمياه وخدمات أخرى

source: Invite Now
ar: شارك التطبيق الآن

source: Select App Language
ar: اختيار لغة التطبيق

source: Enter Your Number
ar: الرجاء ادخال رقمك

source: Country / Region
ar: البلد / المنطقة

source: Your Phone
ar: رقم الهاتف

# ihavereadandacceptedtheprivacypolicy
source: I have read and accepted the privacy policy and term of use
ar: لقد قرأت ووافقت على سياسة الخصوصية وشروط الاستخدام

source: Next
ar: التالي

source: Pending
ar: قيد الانتظار

source: Sort By Type: Water
ar: ترتيب بحسب النوع: ماء

source: Sort By Type: Gas
ar: ترتيب بحسب النوع: غاز

source: No Orders Found
ar: لا توجد طلبيات

source: Is Shop Open ?
ar: هل المحل مفتوح الان ?

source: If you switch on this, your shop will be visible to customers
ar: إذا قمت بتشغيل هذا ، فسيكون متجرك مرئيًا للعملاء

source: Order Received (qty
ar: تم استلام الطلب (الكمية)

source: Order is
ar: الطلبية تكون

source: Order Detail
ar: تفاصيل الطلب

source: Client Detail
ar: بيانات العميل

source: By
ar: بواسطة

source: Product
ar: المنتج

source: Update Shipping Status
ar: تعديل حالة الشحن

source: Shipped
ar: تم الشحن

source: Delivered
ar: تم التوصيل

# shippingStatus
source: Are you sure to update shipping status this order to
ar: حالة الشحن

# onceConfirmd
source: Once confirmed you can revert back
ar: تاكيد الطلب

source: Send Message
ar: أرسال رسالة

source: Hello we have arrived at your location
ar: مرحبًا ، لقد وصلنا إلى عنوانك

source: Call
ar: أتصال

source: Service Provider Detail
ar: بيانات المحل

source: Order to
ar: طلبية الى

source: Your Address:
ar: العنوان:

source: Fill the code
ar: املأ الكود

source: Resend
ar: إعادة إلارسال

source: Personal Detail
ar: بيانات المستخدم

source: Shop Details
ar: تفاصيل المحل

source: Update Name
ar: تعديل الأسم

source: Email
ar: عنوان البريد الألكتروني

source: Update Email
ar: تغيير البريد الألكتروني

source: Update Role
ar: تغيير دور المستخدام

source: Mobile Number
ar: رقم الهاتف

source: Currency
ar: العملة

source: Currency Cannot be updated
ar: العملة لا يمكن تغييرها

source: Shop Images
ar: صور المحل

source: Add Image
ar: إضافة صورة

source: Shop Has no Image to display
ar: المحل ليس لديه صورة لعرضها

source: Cancel
ar: الغاء

source: Add Money
ar: أضافة نقود

source: Client
ar: ألعميل

source: Gas
ar: غاز

source: Water
ar: ماء

source: Sort
ar: ترتيب

source: Search
ar: بحث

source: Shop Name
ar: أسم المحل

source: No Products
ar: لا توجد منتجات

source: No Adress
ar: لا يوجد عنوان

source: Adress Not Found
ar: لم يتم العثور على العنوان

source: Shop Address
ar: عنوان المحل

source: Phone Number
ar: رقم الهاتف

source: Offers Only for you
ar: العروض

source: Products
ar: المنتجات

source: This Shop Has no products
ar: هذا المحل لا يوجد لديه منتجات

source: Select Shop Type
ar: حدد نوع المحل

source: Support us on
ar: ادعمنا على

source: Your Balance
ar: رصيدك

source: Enter the amount
ar: أدخل المبلغ

source: Deposit Money
ar: إيداع المال

source: Card Number
ar: رقم الحساب البنكي

source: Add Card
ar: إضافة بيانات البطاقة البنكية

source: You are Offline
ar: انت غير متاح

source: Back To Online
ar: انت متاح

# continueText
source: Continue
ar: استمر

# authenticated
source: User is Authenticated
ar: المستخدم معتمد

# invalid_otp_or_mobile_number
source: Invalid OTP or Phone Number
ar: رمز التحقق أو رقم الهاتف غير صحيح

# otp_sent_successfully_to
source: OTP has been successfully sent on the phone number :
ar: تم أرسال رمز التحقق :

source: Apt.No
ar: رقم الشقة

source: Payment Summary
ar: تقرير الدفع

# updateShipping
source: Are you sure to update shipping status this order to
ar: تغيير حالة الشحن

# onceDone
source: Once confirmed you can revert back
ar: تاكيد الطب

source: Notify Client
ar: إخطار العميل

source: Name
ar: الأسم

source: Role
ar: دور المستخدم

source: Sort By Rating
ar: الترتيب حسب التقييم

source: Offer
ar: العروض

source: Shops
ar: المحلات

source: Shop
ar: المحل

source: Place a Order
ar: طلب

source: Security Code
ar: رمز الحماية

source: Expiary Date
ar: تاريخ انتهاء الصلاحية

source: Quantity
ar: الكمية

source: Liters
ar: لتر

source: Price
ar: السعر

source: Stock
ar: مخزون

source: Published
ar: متاح

source: Draft
ar: سحب

source: Are you sure to remove this item from cart
ar: إزالة العنصر من سلة المشتريات

source: removed
ar: محذوف

source: Order Again
ar: أطلب مرة أخرى

source: Item
ar: منتج

source: Payment Method
ar: طريقة الدفع

source: Cash
ar: نقدا

source: Payment Status
ar: حالة الدفع

source: Order Quantity
ar: الكمية المطلوبة

source: Order Status
ar: حالة الطلبية

source: Buyer Name
ar: أسم العميل

source: Buyer Address
ar: عنوان العميل

source: Address
ar: العنوان

source: Data Not Available
ar: البيانات غير متوفرة

# updatingYourLocation
source: Updating your current location
ar: تغيير العنوان

# locationPermissionRequired
source: Location permission is required to work app
ar: التطبيق يتطلب الوصول الى العنوان

# pleaseAllowPermission
source: Please allow location permission to continue
ar: يرجى السماح بالوصول الى العنوان للأستمرار

source: Sort by Product Type
ar: فرز حسب نوع المنتج

source: Sort by Shop Rating
ar: الترتيب حسب تقييم المحل

source: Rating
ar: التقييم

source: No Shops Found
ar: لا يوجد محل

# forString
source: for
ar: إلى عن على

source: Product Description
ar: وصف المنتج

source: Enter Quantity Available
ar: ادخل الكمية المتوفرة بالمحل

source: Enter Offer Price
ar: ادخل سعر العرض

# noNotifications
source: No Notification
ar: لا إشعارات

source: Other
ar: آخر

source: Order no
ar: رقم الطلب

source: Order is Pending
ar: الطلب قيد الانتظار

source: Order is Shipped
ar: تم شحن الطلب

source: Order is Delivered
ar: تم استلام الطلب

source: Add All Standard Products
ar: إضافة كل المنتجات المعيارية

source: Show location on Map
ar: عرض الموقع على الخريطة

# summary
source: Summary Report
ar: التقرير التفصيلي

source: Go to Basket
ar: اذهب الى السلة

source: Select Date Range
ar: اختر الفترة الزمنية

source: From
ar: من

source: To
ar: الى

source: Loading
ar: تحميل

source: Standard Products
ar: المنتجات المعيارية

source: Withdrew Money
ar: سحب النقود

source: Not Enough Balance
ar: رصيدك غير كافي

# minimumIs
source: Minimum Withdrawal amount is
ar: الحد الأدنى للسحب هو

source: Withdrawal History
ar: تاريخ السحب

source: Amount
ar: المبلغ

# yourAccountIsBlocked
source: Your Account is temporarily suspended please contact on Mobile No
ar: تم إيقاف حسابك مؤقتًا ، يرجى الاتصال على الرقم

source: or email address
ar: أو عنوان البريد الإلكتروني

source: for support
ar: للدعم

source: Accept
ar: قبول

source: Reject
ar: رفض

source: Rejected
ar: تم رفض الطلب

# orderReceivedThanks
source: We have received your order thanks
ar: تم استلام طلبك،شكرا

source: App Charges
ar: رسوم التطبيق

source: Call This Shop
ar: اتصل بالمحل

# sureToAccept
source: Are you sure you want to accept this order
ar: قبول الطلب؟

source: Enter Product Type
ar: ادخل نوع المنتج

source: Driver
ar: السائق

source: Manage Drivers
ar: إدارة السائقين

source: Your Drivers
ar: السائقين الخاصين بك

source: No Drivers Found
ar: لا يوجد سائق

source: Add Driver
ar: أضافه سائق

# driverPhone
source: Enter Driver Phone
ar: ادخل رقم السائق

source: No Offers For Now
ar: لا يوجد عروض حاليا

# rateOrders
source: Rate This Order
ar: تقييم الطلب

source: Delivery Time
ar: وقت التسليم

source: Delivery Time not set
ar: وقت التسليم غير محدد

source: Expected Delivery Time
ar: وقت التسليم المتوقع

source: Order Time
ar: وقت الطلب

source: Not Rated Yet
ar: لم يتم التقييم بعد

source: Accepted
ar: تم قبول الطلب

source: Note
ar: ملاحظة

source: Note not added
ar: لم يتم إضافة ملاحظة

source: Add Your Note
ar: أضافة ملاحظة

source: Add a note
ar: أضافة ملاحظة

source: Is customer contact visible
ar: هل تريد السماح للسائق برؤية رقم العميل؟

source: Visible
ar: مرئي

source: Invisible
ar: غير مرئي

source: Update Payment Status
ar: تعديل حالة الدفع

source: Add Products
ar: أضافة منتجات جديدة

source: Sort By Location
ar: فرز حسب الموقع

# mobilesAndTablets
source: Mobile and Tablets
ar: أجهزة موبايل

source: Cars and Bikes
ar: السيارات والدراجات

source: Electronics
ar: إلكترونيات

source: Real Estate For Sale
ar: عقارات للبيع

source: Real Estate For Rent
ar: عقارات للإيجار

# imageNotAvailable
source: No Image Available
ar: لا توجد صورة

source: Product Type
ar: نوع المنتج

source: Add Video
ar: إضافة فيديو

source: Select Video
ar: اختيار الفيديو

source: Restaurant and Sweets
ar: مطاعم ومحلات حلويات

# supermarket
source: Super Markets
ar: سوبر ماركت

source: Clothing
ar: الملابس

source: Shoes
ar: أحذية

source: Wholesale Market
ar: سوق الجملة

source: Home Furniture
ar: اثاث

# deleteImage
source: Delete All Images
ar: حذف الصورة

# deleteVideos
source: Delete all Videos
ar: حذف الفيديو
